PREFIX = "/"
GAME_CHANNEL = "основной-штаб"
WAR_CHANNEL = "военные-сводки"
ALLIANCE_CATEGORY = "Альянсы"

HOURS_PER_MONTH = 2
TICKS_PER_MONTH = HOURS_PER_MONTH * 3600
BATTLE_ROUND_INTERVAL_MINUTES = 30
BATTLE_RESPONSE_TIMEOUT_MINUTES = 10

CHANNEL_IDS = {
    "registration": 1529514703737323643,
    "news": 1529793621925040238,
    "lendlease": 1529796191548604536,
    "war_reports": 1529796638963400835
}

CATEGORY_IDS = {
    "alliance": 0,
    "pact": 0
}

COUNTRY_ROLES = {}
IDEOLOGY_ROLES = {
    "Либерализм": 0,
    "Национализм": 0,
    "Социал-демократия": 0,
    "Коммунизм": 0,
    "Демократия": 0,
    "Консерватизм": 0,
    "Национал-демократия": 0,
    "Монархизм": 0,
    "Анархизм": 0
}
GOVERNMENT_ROLES = {
    "Президентская республика": 0,
    "Парламентская республика": 0,
    "Смешанная республика": 0,
    "Конституционная монархия": 0,
    "Абсолютная монархия": 0,
    "Дуалистическая монархия": 0,
    "Теократия": 0,
    "Однопартийная республика": 0
}
RELIGION_ROLES = {
    "Христианство": 0,
    "Ислам": 0,
    "Иудаизм": 0,
    "Буддизм": 0,
    "Индуизм": 0,
    "Светское государство": 0,
    "Запрет на религию": 0
}
DEFAULT_PLAYER_ROLE_ID = 0
