BUILDING_TYPES = {
    "Ферма": {
        "cost": {"Доллары": 25_000, "Продовольствие": 50_000},
        "build_time": 60,          # секунд
        "upgrade_multiplier": 1.5,
        "produces": {"Продовольствие": 10}
    },
    "Шахта": {
        "cost": {"Доллары": 100_000, "Древесина": 30_000},
        "build_time": 90,
        "upgrade_multiplier": 1.8,
        "produces": {"Уголь": 8, "Железная руда": 5}
    },
    "Бизнес-центр": {
        "cost": {"Доллары": 200_000, "Бетон": 20_000, "Сталь": 10_000},
        "build_time": 120,
        "upgrade_multiplier": 2.0,
        "produces": {"Доллары": 50_000}
    },
    "Казарма": {
        "cost": {"Доллары": 50_000, "Продовольствие": 150, "Древесина": 12_000, "Бетон": 2_000},
        "build_time": 150,
        "upgrade_multiplier": 1.7,
        "produces": {}
    },
    "Лаборатория": {
        "cost": {"Доллары": 30_000_000, "Электроэнергия": 100, "Бетон": 48_000, "Сталь": 72_000},
        "build_time": 200,
        "upgrade_multiplier": 2.2,
        "produces": {"Очки науки": 5}
    }
}
