# data/military.py

MILITARY_EQUIPMENT = {
    "морские": [
        "авианосцы", "крейсера", "эсминцы", "фрегаты", "корветы",
        "атомные подводные лодки стратегического назначения",
        "атомные подводные лодки", "патрульные катера", "десантные корабли"
    ],
    "сухопутные": [
        "танки", "БМП", "БТР", "бронеавтомобили", "самоходные установки",
        "РСЗО", "наземные пусковые установки баллистических/крылатых ракет",
        "гаубицы", "пушки", "минометы", "противотанковые пушки",
        "зенитные ракетные комплексы ПЗРК"
    ],
    "воздушные": [
        "истребители", "фронтовые бомбардировщики", "штурмовики",
        "стратегические бомбардировщики",
        "самолёты дальнего радиолокационного обнаружения и управления",
        "самолёты радиоэлектронной борьбы и разведки",
        "военно-транспортные самолёты", "противолодочные самолёты",
        "ударные вертолеты", "многоцелевые вертолеты", "транспортные вертолеты"
    ],
    "беспилотные аппараты": [
        "БПЛА"
    ],
    "разведка": [
        "радиолокационные станции", "оптико-электронные комплексы разведки",
        "звукометрические и сейсмические датчики", "комплексы артиллерийской разведки"
    ]
}

WEAPONS = {
    "ракеты": [
        "ракета класса 'Земля-Земля'", "ракета класса 'Земля-Воздух'",
        "ракета класса 'Воздух-Земля'", "ракета класса 'Воздух-Воздух'",
        "межконтинентальные баллистические ракеты", "тактические баллистические ракеты",
        "крылатые ракеты", "зенитные управляемые ракеты", "противотанковые ракеты",
        "противокорабельные ракеты", "противолодочные ракеты",
        "химическое оружие", "атомное оружие"
    ],
    "стрелковое и лёгкое": [
        "пистолеты", "пистолеты-пулеметы", "штурмовые винтовки",
        "пулеметы", "снайперские винтовки", "гранатометы",
        "ручные огнеметы", "ручные осколочные гранаты",
        "холодное оружие", "малокалиберная ствольная артиллерия"
    ]
}
